export default function ProfileForm() {
	return (
		<div className=" flex items-start gap-5 self-stretch ">
			<div className=" flex max-w-[730px] p-5 flex-col items-start gap-[30px] rounded-lg border-[1px] border-solid border-[var(--border)] bg-[var(--primary-foreground)] ">
				<div className=" flex justify-between items-center self-stretch ">
					<h1 className=" text-[var(--text-primary)] text-xl not-italic font-medium leading-normal ">
						ข้อมูลส่วนบุคคล
					</h1>
					<div className=" flex py-1.5 px-2 justify-center items-center gap-1 cursor-pointer ">
						<div className=" w-5 h-5 ">
							<svg xmlns="http://www.w3.org/2000/svg" width={20} height={21} viewBox="0 0 20 21" fill="none">
								<path d="M13.6878 4.3375L14.5128 3.5125C14.841 3.18429 15.2862 2.99991 15.7503 2.99991C16.2145 2.99991 16.6596 3.18429 16.9878 3.5125C17.316 3.8407 17.5004 4.28585 17.5004 4.75C17.5004 5.21415 17.316 5.65929 16.9878 5.9875L16.1628 6.8125M13.6878 4.3375L8.13783 9.8875C7.71505 10.3106 7.4152 10.8406 7.27033 11.4208L6.66699 13.8333L9.08033 13.23C9.6607 13.0849 10.1907 12.7847 10.6137 12.3617L16.1628 6.8125M13.6878 4.3375L16.1628 6.8125" stroke="#1F1F1F" strokeWidth="1.25" strokeLinejoin="round" />
								<path d="M15.8333 11.75C15.8333 14.49 15.8333 15.8592 15.0767 16.7817C14.9383 16.9503 14.7836 17.1049 14.615 17.2433C13.6917 18 12.3233 18 9.58333 18H9.16667C6.02417 18 4.4525 18 3.47667 17.0233C2.50083 16.0467 2.5 14.4758 2.5 11.3333V10.9167C2.5 8.17749 2.5 6.80749 3.25667 5.88499C3.39556 5.7161 3.54944 5.56221 3.71833 5.42332C4.64167 4.66666 6.01 4.66666 8.75 4.66666" stroke="#1F1F1F" strokeWidth="1.25" strokeLinecap="round" strokeLinejoin="round" />
							</svg>
						</div>
						<div className=" text-sm not-italic font-medium underline decoration-solid decoration-auto underline-offset-auto [text-decoration-skip-ink:none] [text-underline-position:from-font] ">แก้ไข</div>
					</div>
				</div>
				<div className=" flex items-center gap-5 ">
					<div className=" flex w-[90px] h-[90px] pt-[19px] pr-[26px] pb-[20px] pl-[26px] flex-col justify-center items-center aspect-square rounded-full border-[1px] border-solid border-[#E5E5E5] bg-[var(--background-secondary)] ">
						<div className=" w-10 h-10 shrink-0 ">
							<svg xmlns="http://www.w3.org/2000/svg" width="40" height="41" viewBox="0 0 40 41" fill="none">
								<path fillRule="evenodd" clipRule="evenodd" d="M10 8C7.23858 8 5 10.2385 5 13V28C5 30.7615 7.23858 33 10 33H30C32.7615 33 35 30.7615 35 28V13C35 10.2385 32.7615 8 30 8H10ZM10 10.5C8.61931 10.5 7.5 11.6193 7.5 13V28L11.3832 24.1168C12.0285 23.4715 13.0448 23.3845 13.7903 23.9108L17.6122 26.6086C17.7298 26.6916 17.8888 26.6836 17.9975 26.5892L23.6804 21.6475C24.4236 21.0012 25.5402 21.0402 26.2365 21.7365L32.5 28V13C32.5 11.6193 31.3807 10.5 30 10.5H10ZM13.75 19.25C15.1307 19.25 16.25 18.1307 16.25 16.75C16.25 15.3693 15.1307 14.25 13.75 14.25C12.3693 14.25 11.25 15.3693 11.25 16.75C11.25 18.1307 12.3693 19.25 13.75 19.25Z" fill="#808080">
								</path>
							</svg>
						</div>
					</div>
					<div className=" flex w-[320px] flex-col items-start gap-2.5 ">
						<button className=" flex py-2 px-3 justify-center items-center gap-2 rounded-md border-[1px] border-solid border-[var(--border)] bg-white ">
							<div className=" w-4 h-4 ">
								<svg xmlns="http://www.w3.org/2000/svg" width="16" height="16" viewBox="0 0 16 16" fill="none">
									<path d="M3.5 2C3.36739 2 3.24021 2.05268 3.14645 2.14645C3.05268 2.24021 3 2.36739 3 2.5C3 2.63261 3.05268 2.75979 3.14645 2.85355C3.24021 2.94732 3.36739 3 3.5 3H12.5C12.6326 3 12.7598 2.94732 12.8536 2.85355C12.9473 2.75979 13 2.63261 13 2.5C13 2.36739 12.9473 2.24021 12.8536 2.14645C12.7598 2.05268 12.6326 2 12.5 2H3.5ZM8.354 4.146C8.30755 4.09944 8.25238 4.06249 8.19163 4.03729C8.13089 4.01208 8.06577 3.99911 8 3.99911C7.93423 3.99911 7.86911 4.01208 7.80837 4.03729C7.74762 4.06249 7.69245 4.09944 7.646 4.146L4.146 7.646C4.09951 7.69249 4.06264 7.74768 4.03748 7.80842C4.01232 7.86916 3.99937 7.93426 3.99937 8C3.99937 8.06574 4.01232 8.13084 4.03748 8.19158C4.06264 8.25232 4.09951 8.30751 4.146 8.354C4.19249 8.40049 4.24768 8.43736 4.30842 8.46252C4.36916 8.48768 4.43426 8.50063 4.5 8.50063C4.56574 8.50063 4.63084 8.48768 4.69158 8.46252C4.75232 8.43736 4.80751 8.40049 4.854 8.354L7.5 5.707V13.5C7.5 13.6326 7.55268 13.7598 7.64645 13.8536C7.74021 13.9473 7.86739 14 8 14C8.13261 14 8.25979 13.9473 8.35355 13.8536C8.44732 13.7598 8.5 13.6326 8.5 13.5V5.707L11.146 8.354C11.2399 8.44789 11.3672 8.50063 11.5 8.50063C11.6328 8.50063 11.7601 8.44789 11.854 8.354C11.9479 8.26011 12.0006 8.13278 12.0006 8C12.0006 7.86722 11.9479 7.73989 11.854 7.646L8.354 4.146Z" fill="#1F1F1F" />
								</svg>
							</div>
							<div className=" text-[var(--text-primary)] text-sm not-italic font-medium leading-normal ">
								อัปโหลดรูปภาพ
							</div>
						</button>
						<div className=" text-[var(--text-primary)] text-xs not-italic font-normal leading-normal ">
							กรุณาอัปโหลดรูปถ่ายหน้าตรงและชัดเจน ไฟล์ <strong>JPG หรือ PNG</strong> ขนาดไม่เกิน  <strong>5 MB</strong>.
						</div>
					</div>
				</div>
				<div className=" flex w-[603px] flex-col items-start gap-5 ">
					<div className=" flex w-[294px] flex-col items-start gap-2.5 ">
						<label className=" flex flex-col items-start gap-2.5 self-stretch ">
							<span className=" text-[var(--text-primary)] text-sm not-italic font-medium leading-[110%] ">รหัสบุคลากร</span>
							<div className=" flex h-[44px] py-0 px-3.5 items-center gap-2.5 self-stretch rounded-lg border-[1px] border-solid border-[var(--border)] ">
								<svg xmlns="http://www.w3.org/2000/svg" width="20" height="20" viewBox="0 0 20 20" fill="none">
									<path d="M1.25 5.9375C1.25 4.73 2.23 3.75 3.4375 3.75H16.5625C17.77 3.75 18.75 4.73 18.75 5.9375V14.0625C18.75 14.6427 18.5195 15.1991 18.1093 15.6093C17.6991 16.0195 17.1427 16.25 16.5625 16.25H3.4375C2.85734 16.25 2.30094 16.0195 1.8907 15.6093C1.48047 15.1991 1.25 14.6427 1.25 14.0625V5.9375ZM3.4375 5C3.18886 5 2.9504 5.09877 2.77459 5.27459C2.59877 5.4504 2.5 5.68886 2.5 5.9375V14.0625C2.5 14.58 2.92 15 3.4375 15H16.5625C16.8111 15 17.0496 14.9012 17.2254 14.7254C17.4012 14.5496 17.5 14.3111 17.5 14.0625V5.9375C17.5 5.68886 17.4012 5.4504 17.2254 5.27459C17.0496 5.09877 16.8111 5 16.5625 5H3.4375ZM11.875 7.5C11.7092 7.5 11.5503 7.56585 11.4331 7.68306C11.3158 7.80027 11.25 7.95924 11.25 8.125C11.25 8.29076 11.3158 8.44973 11.4331 8.56694C11.5503 8.68415 11.7092 8.75 11.875 8.75H15.625C15.7908 8.75 15.9497 8.68415 16.0669 8.56694C16.1842 8.44973 16.25 8.29076 16.25 8.125C16.25 7.95924 16.1842 7.80027 16.0669 7.68306C15.9497 7.56585 15.7908 7.5 15.625 7.5H11.875ZM11.875 11.25C11.7092 11.25 11.5503 11.3158 11.4331 11.4331C11.3158 11.5503 11.25 11.7092 11.25 11.875C11.25 12.0408 11.3158 12.1997 11.4331 12.3169C11.5503 12.4342 11.7092 12.5 11.875 12.5H15.625C15.7908 12.5 15.9497 12.4342 16.0669 12.3169C16.1842 12.1997 16.25 12.0408 16.25 11.875C16.25 11.7092 16.1842 11.5503 16.0669 11.4331C15.9497 11.3158 15.7908 11.25 15.625 11.25H11.875ZM6.57625 9.6425C6.79901 9.6425 7.01958 9.59863 7.22538 9.51338C7.43118 9.42814 7.61817 9.30319 7.77568 9.14568C7.93319 8.98817 8.05814 8.80118 8.14338 8.59538C8.22863 8.38958 8.2725 8.169 8.2725 7.94625C8.2725 7.7235 8.22863 7.50292 8.14338 7.29712C8.05814 7.09132 7.93319 6.90433 7.77568 6.74682C7.61817 6.58931 7.43118 6.46436 7.22538 6.37912C7.01958 6.29387 6.79901 6.25 6.57625 6.25C6.12638 6.25 5.69493 6.42871 5.37682 6.74682C5.05871 7.06493 4.88 7.49638 4.88 7.94625C4.88 8.39612 5.05871 8.82757 5.37682 9.14568C5.69493 9.46379 6.12638 9.6425 6.57625 9.6425ZM4.8225 10.49C4.53826 10.4907 4.26585 10.6039 4.06486 10.8049C3.86387 11.0058 3.75066 11.2783 3.75 11.5625C3.75004 12.028 3.90568 12.4802 4.19219 12.8471C4.4787 13.214 4.87963 13.4746 5.33125 13.5875L5.3975 13.605C6.1725 13.7987 6.98125 13.7987 7.755 13.605L7.8225 13.5888C8.27412 13.4759 8.67505 13.2152 8.96156 12.8483C9.24807 12.4814 9.40371 12.0293 9.40375 11.5638C9.40342 11.2793 9.29036 11.0066 9.08933 10.8053C8.88831 10.604 8.61571 10.4907 8.33125 10.49H4.8225Z" fill="#969696" />
								</svg>
								<input type="text" placeholder="กรอกรหัสบุคลากร" className=" flex w-full h-full px-0 text-sm not-italic font-normal leading-normal focus:outline-none " />
							</div>
						</label>
					</div>
					<div className=" flex items-start gap-4 self-stretch ">
						<div className=" flex flex-col items-start gap-2.5 flex-[1_0_0] ">
							<label className=" flex flex-col items-start gap-2.5 self-stretch ">
								<span className=" text-[var(--text-primary)] text-sm not-italic font-medium leading-[110%] ">ตำแหน่งทางวิชาการ</span>
								<div className=" flex h-[44px] py-0 px-3.5 items-center gap-2.5 self-stretch rounded-lg border-[1px] border-solid border-[var(--border)] ">
									<svg xmlns="http://www.w3.org/2000/svg" width="20" height="20" viewBox="0 0 20 20" fill="none">
										<path d="M11.7103 3.05875C11.2019 2.72638 10.6077 2.54938 10.0003 2.54938C9.39293 2.54938 8.7987 2.72638 8.29032 3.05875L1.53282 7.475C1.43669 7.53776 1.35971 7.62579 1.31031 7.72943C1.26092 7.83306 1.24103 7.9483 1.25282 8.0625L1.25032 8.125V13.125C1.25032 13.2908 1.31616 13.4497 1.43337 13.5669C1.55058 13.6841 1.70956 13.75 1.87532 13.75C2.04108 13.75 2.20005 13.6841 2.31726 13.5669C2.43447 13.4497 2.50032 13.2908 2.50032 13.125V9.1775L3.75032 10.0237V14.6237C3.7503 14.7727 3.8035 14.9168 3.90032 15.03L3.90282 15.0337L3.91032 15.0425L3.93532 15.07L4.02032 15.1625C4.09407 15.24 4.20032 15.3475 4.33782 15.475C4.61282 15.7287 5.01657 16.0637 5.53657 16.4C6.57407 17.07 8.09782 17.75 10.0003 17.75C11.9028 17.75 13.4253 17.07 14.4641 16.4C14.9841 16.0637 15.3878 15.7287 15.6628 15.475C15.8021 15.3452 15.9363 15.2101 16.0653 15.07L16.0903 15.0425L16.0978 15.0337L16.1003 15.0312L16.1016 15.0287C16.1974 14.916 16.2501 14.7729 16.2503 14.625V10.0225L18.4753 8.51625C18.5651 8.4632 18.6383 8.38625 18.6869 8.29398C18.7354 8.20171 18.7574 8.09777 18.7503 7.99375C18.7495 7.89058 18.7232 7.78921 18.6737 7.69869C18.6242 7.60818 18.553 7.53133 18.4666 7.475L11.7103 3.05875ZM15.0003 10.87V14.3775C14.9503 14.4275 14.8882 14.4871 14.8141 14.5562C14.4951 14.8496 14.1513 15.1148 13.7866 15.3487C12.8866 15.9287 11.5978 16.4987 10.0003 16.4987C8.40282 16.4987 7.11282 15.9287 6.21407 15.3487C5.77693 15.0679 5.37016 14.7424 5.00032 14.3775V10.87L8.24907 13.0687C8.7661 13.4186 9.37605 13.6056 10.0003 13.6056C10.6246 13.6056 11.2345 13.4186 11.7516 13.0687L15.0003 10.87ZM8.97407 4.105C9.27915 3.90547 9.63578 3.79921 10.0003 3.79921C10.3649 3.79921 10.7215 3.90547 11.0266 4.105L16.9966 8L11.0516 12.0337C10.7412 12.2439 10.3751 12.3562 10.0003 12.3562C9.62555 12.3562 9.25939 12.2439 8.94907 12.0337L3.00282 8.00875L8.97407 4.105Z" fill="#969696" />
									</svg>
									<div className=" w-full text-[var(--text-secondary)] text-sm ">ตำแหน่งทางวิชาการ</div>
									<svg xmlns="http://www.w3.org/2000/svg" width="18" height="18" viewBox="0 0 18 18" fill="none">
										<path d="M3.53928 6.35175C3.59153 6.29936 3.6536 6.2578 3.72194 6.22945C3.79028 6.20109 3.86354 6.18649 3.93753 6.18649C4.01152 6.18649 4.08478 6.20109 4.15312 6.22945C4.22146 6.2578 4.28353 6.29936 4.33578 6.35175L9.00003 11.0171L13.6643 6.35175C13.7699 6.24613 13.9132 6.18679 14.0625 6.18679C14.2119 6.18679 14.3552 6.24613 14.4608 6.35175C14.5664 6.45737 14.6257 6.60063 14.6257 6.75C14.6257 6.89937 14.5664 7.04263 14.4608 7.14825L9.39828 12.2107C9.34603 12.2631 9.28395 12.3047 9.21562 12.333C9.14728 12.3614 9.07402 12.376 9.00003 12.376C8.92604 12.376 8.85278 12.3614 8.78444 12.333C8.7161 12.3047 8.65403 12.2631 8.60178 12.2107L3.53928 7.14825C3.4869 7.096 3.44533 7.03392 3.41698 6.96559C3.38862 6.89725 3.37402 6.82399 3.37402 6.75C3.37402 6.67601 3.38862 6.60275 3.41698 6.53441C3.44533 6.46607 3.4869 6.404 3.53928 6.35175Z" fill="#969696" />
									</svg>
								</div>
							</label>
						</div>
						<div className=" flex flex-col items-start gap-2.5 flex-[1_0_0] ">
							<label className=" flex flex-col items-start gap-2.5 self-stretch ">
								<span className=" text-[var(--text-primary)] text-sm not-italic font-medium leading-[110%] ">คำนำหน้า</span>
								<div className=" flex h-[44px] py-0 px-3.5 items-center gap-2.5 self-stretch rounded-lg border-[1px] border-solid border-[var(--border)] ">
									<div className="w-[22px] h-[18px] relative rounded-full border-[1px] border-solid border-[var(--border)]" />
									<div className=" w-full text-[var(--text-secondary)] text-sm ">คำนำหน้า ดร.</div>
								</div>
							</label>
						</div>
					</div>
					<div className=" flex items-start gap-4 self-stretch ">
						<div className=" flex flex-col items-start gap-2.5 flex-[1_0_0] ">
							<label className=" flex flex-col items-start gap-2.5 self-stretch ">
								<span className=" text-[var(--text-primary)] text-sm not-italic font-medium leading-[110%] ">ชื่อจริง</span>
								<div className=" flex h-[44px] py-0 px-3.5 items-center gap-2.5 self-stretch rounded-lg border-[1px] border-solid border-[var(--border)] ">
									<input type="text" placeholder="กรอกชื่อจริง" className=" flex w-full h-full px-0 text-sm not-italic font-normal leading-normal focus:outline-none " />
								</div>
							</label>
						</div>
						<div className=" flex flex-col items-start gap-2.5 flex-[1_0_0] ">
							<label className=" flex flex-col items-start gap-2.5 self-stretch ">
								<span className=" text-[var(--text-primary)] text-sm not-italic font-medium leading-[110%] ">นามสกุล</span>
								<div className=" flex h-[44px] py-0 px-3.5 items-center gap-2.5 self-stretch rounded-lg border-[1px] border-solid border-[var(--border)] ">
									<input type="text" placeholder="กรอกนามสกุล" className=" flex w-full h-full px-0 text-sm not-italic font-normal leading-normal focus:outline-none " />
								</div>
							</label>
						</div>
					</div>
					<div className=" flex items-start gap-4 self-stretch ">
						<div className=" flex flex-col items-start gap-2.5 flex-[1_0_0] ">
							<label className=" flex flex-col items-start gap-2.5 self-stretch ">
								<span className=" text-[var(--text-primary)] text-sm not-italic font-medium leading-[110%] ">วันเดือนปีเกิด</span>
								<div className=" flex h-[44px] py-0 px-3.5 items-center gap-2.5 self-stretch rounded-lg border-[1px] border-solid border-[var(--border)] ">
									<svg xmlns="http://www.w3.org/2000/svg" width="20" height="20" viewBox="0 0 20 20" fill="none">
										<path d="M6.56 11.2463C6.80814 11.2463 7.04612 11.1477 7.22159 10.9722C7.39705 10.7967 7.49563 10.5588 7.49563 10.3106C7.49563 10.0625 7.39705 9.8245 7.22159 9.64904C7.04612 9.47357 6.80814 9.375 6.56 9.375C6.31186 9.375 6.07388 9.47357 5.89841 9.64904C5.72295 9.8245 5.62437 10.0625 5.62437 10.3106C5.62437 10.5588 5.72295 10.7967 5.89841 10.9722C6.07388 11.1477 6.31186 11.2463 6.56 11.2463ZM7.49625 13.4362C7.49625 13.6844 7.39768 13.9224 7.22221 14.0978C7.04675 14.2733 6.80877 14.3719 6.56063 14.3719C6.31248 14.3719 6.0745 14.2733 5.89904 14.0978C5.72357 13.9224 5.625 13.6844 5.625 13.4362C5.625 13.1881 5.72357 12.9501 5.89904 12.7747C6.0745 12.5992 6.31248 12.5006 6.56063 12.5006C6.80877 12.5006 7.04675 12.5992 7.22221 12.7747C7.39768 12.9501 7.49625 13.1881 7.49625 13.4362ZM10 11.2463C10.2481 11.2463 10.4861 11.1477 10.6616 10.9722C10.8371 10.7967 10.9356 10.5588 10.9356 10.3106C10.9356 10.0625 10.8371 9.8245 10.6616 9.64904C10.4861 9.47357 10.2481 9.375 10 9.375C9.75186 9.375 9.51388 9.47357 9.33841 9.64904C9.16295 9.8245 9.06437 10.0625 9.06437 10.3106C9.06437 10.5588 9.16295 10.7967 9.33841 10.9722C9.51388 11.1477 9.75186 11.2463 10 11.2463ZM10.9362 13.4362C10.9362 13.6844 10.8377 13.9224 10.6622 14.0978C10.4867 14.2733 10.2488 14.3719 10.0006 14.3719C9.75248 14.3719 9.5145 14.2733 9.33904 14.0978C9.16357 13.9224 9.065 13.6844 9.065 13.4362C9.065 13.1881 9.16357 12.9501 9.33904 12.7747C9.5145 12.5992 9.75248 12.5006 10.0006 12.5006C10.2488 12.5006 10.4867 12.5992 10.6622 12.7747C10.8377 12.9501 10.9362 13.1881 10.9362 13.4362ZM13.4362 11.2463C13.6844 11.2463 13.9224 11.1477 14.0978 10.9722C14.2733 10.7967 14.3719 10.5588 14.3719 10.3106C14.3719 10.0625 14.2733 9.8245 14.0978 9.64904C13.9224 9.47357 13.6844 9.375 13.4362 9.375C13.1881 9.375 12.9501 9.47357 12.7747 9.64904C12.5992 9.8245 12.5006 10.0625 12.5006 10.3106C12.5006 10.5588 12.5992 10.7967 12.7747 10.9722C12.9501 11.1477 13.1881 11.2463 13.4362 11.2463ZM17.5 5.625C17.5 4.7962 17.1708 4.00134 16.5847 3.41529C15.9987 2.82924 15.2038 2.5 14.375 2.5H5.625C4.7962 2.5 4.00134 2.82924 3.41529 3.41529C2.82924 4.00134 2.5 4.7962 2.5 5.625V14.375C2.5 15.2038 2.82924 15.9987 3.41529 16.5847C4.00134 17.1708 4.7962 17.5 5.625 17.5H14.375C15.2038 17.5 15.9987 17.1708 16.5847 16.5847C17.1708 15.9987 17.5 15.2038 17.5 14.375V5.625ZM3.75 7.5H16.25V14.375C16.25 14.8723 16.0525 15.3492 15.7008 15.7008C15.3492 16.0525 14.8723 16.25 14.375 16.25H5.625C5.12772 16.25 4.65081 16.0525 4.29917 15.7008C3.94754 15.3492 3.75 14.8723 3.75 14.375V7.5ZM5.625 3.75H14.375C14.8723 3.75 15.3492 3.94754 15.7008 4.29917C16.0525 4.65081 16.25 5.12772 16.25 5.625V6.25H3.75V5.625C3.75 5.12772 3.94754 4.65081 4.29917 4.29917C4.65081 3.94754 5.12772 3.75 5.625 3.75Z" fill="#969696" />
									</svg>
									<input type="text" placeholder="เลือกวันเดือนปีเกิด" className=" flex w-full h-full px-0 text-sm not-italic font-normal leading-normal focus:outline-none " />
								</div>
							</label>
						</div>
						<div className=" flex flex-col items-start gap-2.5 flex-[1_0_0] ">
							<label className=" flex flex-col items-start gap-2.5 self-stretch ">
								<span className=" text-[var(--text-primary)] text-sm not-italic font-medium leading-[110%] ">เพศ</span>
								<div className=" flex h-[44px] py-0 px-3.5 items-center gap-2.5 self-stretch rounded-lg border-[1px] border-solid border-[var(--border)] ">
									<div className=" w-full text-[var(--text-secondary)] text-sm ">เลือกเพศของคุณ</div>
									<svg xmlns="http://www.w3.org/2000/svg" width="18" height="18" viewBox="0 0 18 18" fill="none">
										<path d="M3.53928 6.35175C3.59153 6.29936 3.6536 6.2578 3.72194 6.22945C3.79028 6.20109 3.86354 6.18649 3.93753 6.18649C4.01152 6.18649 4.08478 6.20109 4.15312 6.22945C4.22146 6.2578 4.28353 6.29936 4.33578 6.35175L9.00003 11.0171L13.6643 6.35175C13.7699 6.24613 13.9132 6.18679 14.0625 6.18679C14.2119 6.18679 14.3552 6.24613 14.4608 6.35175C14.5664 6.45737 14.6257 6.60063 14.6257 6.75C14.6257 6.89937 14.5664 7.04263 14.4608 7.14825L9.39828 12.2107C9.34603 12.2631 9.28395 12.3047 9.21562 12.333C9.14728 12.3614 9.07402 12.376 9.00003 12.376C8.92604 12.376 8.85278 12.3614 8.78444 12.333C8.7161 12.3047 8.65403 12.2631 8.60178 12.2107L3.53928 7.14825C3.4869 7.096 3.44533 7.03392 3.41698 6.96559C3.38862 6.89725 3.37402 6.82399 3.37402 6.75C3.37402 6.67601 3.38862 6.60275 3.41698 6.53441C3.44533 6.46607 3.4869 6.404 3.53928 6.35175Z" fill="#969696" />
									</svg>
								</div>
							</label>
						</div>
					</div>
				</div>
			</div>
			<div className=" flex max-w-[380px] p-5 flex-col items-start gap-[30px] flex-[1_0_0] rounded-lg border-[1px] border-solid border-[var(--border)] bg-[var(--primary-foreground)] ">
				<div className=" flex justify-between items-center self-stretch ">
					<h1 className=" text-[var(--text-primary)] text-xl not-italic font-medium leading-normal ">
						ข้อมูลติดต่อ
					</h1>
					<div className=" flex py-1.5 px-2 justify-center items-center gap-1 cursor-pointer ">
						<div className=" w-5 h-5 ">
							<svg xmlns="http://www.w3.org/2000/svg" width={20} height={21} viewBox="0 0 20 21" fill="none">
								<path d="M13.6878 4.3375L14.5128 3.5125C14.841 3.18429 15.2862 2.99991 15.7503 2.99991C16.2145 2.99991 16.6596 3.18429 16.9878 3.5125C17.316 3.8407 17.5004 4.28585 17.5004 4.75C17.5004 5.21415 17.316 5.65929 16.9878 5.9875L16.1628 6.8125M13.6878 4.3375L8.13783 9.8875C7.71505 10.3106 7.4152 10.8406 7.27033 11.4208L6.66699 13.8333L9.08033 13.23C9.6607 13.0849 10.1907 12.7847 10.6137 12.3617L16.1628 6.8125M13.6878 4.3375L16.1628 6.8125" stroke="#1F1F1F" strokeWidth="1.25" strokeLinejoin="round" />
								<path d="M15.8333 11.75C15.8333 14.49 15.8333 15.8592 15.0767 16.7817C14.9383 16.9503 14.7836 17.1049 14.615 17.2433C13.6917 18 12.3233 18 9.58333 18H9.16667C6.02417 18 4.4525 18 3.47667 17.0233C2.50083 16.0467 2.5 14.4758 2.5 11.3333V10.9167C2.5 8.17749 2.5 6.80749 3.25667 5.88499C3.39556 5.7161 3.54944 5.56221 3.71833 5.42332C4.64167 4.66666 6.01 4.66666 8.75 4.66666" stroke="#1F1F1F" strokeWidth="1.25" strokeLinecap="round" strokeLinejoin="round" />
							</svg>
						</div>
						<div className=" text-sm not-italic font-medium underline decoration-solid decoration-auto underline-offset-auto [text-decoration-skip-ink:none] [text-underline-position:from-font] ">แก้ไข</div>
					</div>
				</div>
				<div className=" flex flex-col items-start gap-5 self-stretch ">
					<div className=" flex flex-col items-start gap-2.5 self-stretch ">
						<label className=" flex flex-col items-start gap-2.5 self-stretch ">
							<span className=" text-[var(--text-primary)] text-sm not-italic font-medium leading-[110%] ">อีเมล</span>
							<div className=" flex h-[44px] py-0 px-3.5 items-center gap-2.5 self-stretch rounded-lg border-[1px] border-solid border-[var(--border)] bg-[var(--input-disabled)] cursor-not-allowed ">
								<svg xmlns="http://www.w3.org/2000/svg" width="20" height="20" viewBox="0 0 20 20" fill="none">
									<path d="M2.5 7.5475V13.75C2.5 14.413 2.76339 15.0489 3.23223 15.5178C3.70107 15.9866 4.33696 16.25 5 16.25H15C15.663 16.25 16.2989 15.9866 16.7678 15.5178C17.2366 15.0489 17.5 14.413 17.5 13.75V6.25C17.5 5.58696 17.2366 4.95107 16.7678 4.48223C16.2989 4.01339 15.663 3.75 15 3.75H5C4.33696 3.75 3.70107 4.01339 3.23223 4.48223C2.76339 4.95107 2.5 5.58696 2.5 6.25V7.5475ZM5 5H15C15.3315 5 15.6495 5.1317 15.8839 5.36612C16.1183 5.60054 16.25 5.91848 16.25 6.25V7.175L10 10.54L3.75 7.175V6.25C3.75 5.91848 3.8817 5.60054 4.11612 5.36612C4.35054 5.1317 4.66848 5 5 5ZM3.75 8.595L9.70375 11.8C9.7948 11.849 9.89659 11.8747 10 11.8747C10.1034 11.8747 10.2052 11.849 10.2963 11.8L16.25 8.595V13.75C16.25 14.0815 16.1183 14.3995 15.8839 14.6339C15.6495 14.8683 15.3315 15 15 15H5C4.66848 15 4.35054 14.8683 4.11612 14.6339C3.8817 14.3995 3.75 14.0815 3.75 13.75V8.595Z" fill="#969696" />
								</svg>
								<input type="email" placeholder="example@mail.com" className=" flex w-full h-full px-0 text-sm not-italic font-normal leading-normal focus:outline-none read-only:cursor-not-allowed " readOnly />
							</div>
						</label>
					</div>
					<div className=" flex flex-col items-start gap-2.5 self-stretch ">
						<label className=" flex flex-col items-start gap-2.5 self-stretch ">
							<span className=" text-[var(--text-primary)] text-sm not-italic font-medium leading-[110%] ">เบอร์โทรศัพท์มือถือ</span>
							<div className=" flex h-[44px] py-0 px-3.5 items-center gap-2.5 self-stretch rounded-lg border-[1px] border-solid border-[var(--border)]  ">
								<svg xmlns="http://www.w3.org/2000/svg" width="20" height="20" viewBox="0 0 20 20" fill="none">
									<path d="M4.64264 6.57251C4.40389 5.00001 5.51264 3.58751 7.20639 3.07001C7.50697 2.97873 7.83101 3.00518 8.1128 3.14399C8.3946 3.2828 8.61306 3.52358 8.72389 3.81751L9.26764 5.26751C9.35517 5.50078 9.371 5.75488 9.31309 5.9972C9.25519 6.23953 9.12618 6.45902 8.94264 6.62751L7.32514 8.10876C7.24531 8.18185 7.18583 8.27442 7.15252 8.37741C7.11922 8.48039 7.11323 8.59026 7.13514 8.69626L7.15014 8.76126L7.18889 8.92376C7.39055 9.71315 7.69703 10.472 8.10014 11.18C8.54029 11.9318 9.08583 12.6166 9.72014 13.2138L9.77014 13.2588C9.85089 13.3304 9.94883 13.38 10.0544 13.4025C10.16 13.4251 10.2696 13.4199 10.3726 13.3875L12.4639 12.7288C12.7016 12.6541 12.9561 12.6522 13.1949 12.7233C13.4336 12.7943 13.6457 12.9351 13.8039 13.1275L14.7939 14.3288C15.2064 14.8288 15.1564 15.5638 14.6826 16.005C13.3864 17.2138 11.6039 17.4613 10.3639 16.465C8.84329 15.2396 7.56183 13.7442 6.58389 12.0538C5.59638 10.3656 4.93853 8.50578 4.64264 6.57251ZM8.44514 8.77876L9.78514 7.54876C10.1524 7.21193 10.4107 6.77301 10.5267 6.28835C10.6428 5.80369 10.6113 5.29541 10.4364 4.82876L9.89389 3.37876C9.67133 2.78722 9.23195 2.30259 8.66499 2.02329C8.09803 1.74399 7.44602 1.69097 6.84139 1.87501C4.73764 2.51876 3.04889 4.40501 3.40639 6.76126C3.65639 8.40626 4.23264 10.4988 5.50389 12.6838C6.55903 14.5064 7.94132 16.1188 9.58139 17.44C11.4414 18.9338 13.9239 18.4238 15.5364 16.9213C15.9978 16.4917 16.2778 15.9022 16.3194 15.2731C16.361 14.6441 16.161 14.0229 15.7601 13.5363L14.7701 12.3338C14.4534 11.9494 14.0291 11.6683 13.5516 11.5267C13.0741 11.385 12.5652 11.3892 12.0901 11.5388L10.3539 12.085C9.90557 11.6228 9.5129 11.1098 9.18389 10.5563C8.86641 9.99653 8.61873 9.4 8.44639 8.78001" fill="#969696" />
								</svg>
								<input type="tel" placeholder="กรอกเบอร์โทรศัพท์มือถือ" className=" flex w-full h-full px-0 text-sm not-italic font-normal leading-normal focus:outline-none " />
							</div>
						</label>
					</div>
					<div className=" flex flex-col items-start gap-2.5 self-stretch ">
						<label className=" flex flex-col items-start gap-2.5 self-stretch ">
							<span className=" text-[var(--text-primary)] text-sm not-italic font-medium leading-[110%] ">เบอร์โทรศัพท์ที่ทำงาน</span>
							<div className=" flex h-[44px] py-0 px-3.5 items-center gap-2.5 self-stretch rounded-lg border-[1px] border-solid border-[var(--border)]  ">
								<svg xmlns="http://www.w3.org/2000/svg" width="20" height="20" viewBox="0 0 20 20" fill="none">
									<path d="M4.64264 6.57251C4.40389 5.00001 5.51264 3.58751 7.20639 3.07001C7.50697 2.97873 7.83101 3.00518 8.1128 3.14399C8.3946 3.2828 8.61306 3.52358 8.72389 3.81751L9.26764 5.26751C9.35517 5.50078 9.371 5.75488 9.31309 5.9972C9.25519 6.23953 9.12618 6.45902 8.94264 6.62751L7.32514 8.10876C7.24531 8.18185 7.18583 8.27442 7.15252 8.37741C7.11922 8.48039 7.11323 8.59026 7.13514 8.69626L7.15014 8.76126L7.18889 8.92376C7.39055 9.71315 7.69703 10.472 8.10014 11.18C8.54029 11.9318 9.08583 12.6166 9.72014 13.2138L9.77014 13.2588C9.85089 13.3304 9.94883 13.38 10.0544 13.4025C10.16 13.4251 10.2696 13.4199 10.3726 13.3875L12.4639 12.7288C12.7016 12.6541 12.9561 12.6522 13.1949 12.7233C13.4336 12.7943 13.6457 12.9351 13.8039 13.1275L14.7939 14.3288C15.2064 14.8288 15.1564 15.5638 14.6826 16.005C13.3864 17.2138 11.6039 17.4613 10.3639 16.465C8.84329 15.2396 7.56183 13.7442 6.58389 12.0538C5.59638 10.3656 4.93853 8.50578 4.64264 6.57251ZM8.44514 8.77876L9.78514 7.54876C10.1524 7.21193 10.4107 6.77301 10.5267 6.28835C10.6428 5.80369 10.6113 5.29541 10.4364 4.82876L9.89389 3.37876C9.67133 2.78722 9.23195 2.30259 8.66499 2.02329C8.09803 1.74399 7.44602 1.69097 6.84139 1.87501C4.73764 2.51876 3.04889 4.40501 3.40639 6.76126C3.65639 8.40626 4.23264 10.4988 5.50389 12.6838C6.55903 14.5064 7.94132 16.1188 9.58139 17.44C11.4414 18.9338 13.9239 18.4238 15.5364 16.9213C15.9978 16.4917 16.2778 15.9022 16.3194 15.2731C16.361 14.6441 16.161 14.0229 15.7601 13.5363L14.7701 12.3338C14.4534 11.9494 14.0291 11.6683 13.5516 11.5267C13.0741 11.385 12.5652 11.3892 12.0901 11.5388L10.3539 12.085C9.90557 11.6228 9.5129 11.1098 9.18389 10.5563C8.86641 9.99653 8.61873 9.4 8.44639 8.78001" fill="#969696" />
								</svg>
								<input type="tel" placeholder="กรอกเบอร์โทรศัพท์ที่ทำงาน" className=" flex w-full h-full px-0 text-sm not-italic font-normal leading-normal focus:outline-none " />
							</div>
						</label>
					</div>
				</div>
			</div>
		</div>
	)
}